RobWilks/nrf51_ADXL345/main_adxl345_fatfs.c
        const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_ENABLED,
          false,
          UART_BAUDRATE_BAUDRATE_Baud115200
      };

    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);

    APP_ERROR_CHECK(err_code);



    // Start internal LFCLK XTAL oscillator - it is needed by BSP to handle
    // buttons with the use of APP_TIMER and for "read_all" ticks generation
    // (by RTC).
    lfclk_config();

    bsp_config();

    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));

    uart_printf("TWI master example\r\n");
    twi_config();

    // Initialize sensors.
    /*
    APP_ERROR_CHECK(app_twi_perform(&m_app_twi, lm75b_init_transfers,
        LM75B_INIT_TRANSFER_COUNT, NULL));
    APP_ERROR_CHECK(app_twi_perform(&m_app_twi, mma7660_init_transfers,
        MMA7660_INIT_TRANSFER_COUNT, NULL));

    */


//    rjw initialisation of ADX345 

    APP_ERROR_CHECK(app_twi_perform(&m_app_twi, adxl345_init_transfers,
        ADXL345_INIT_TRANSFER_COUNT, NULL));

    /*************************** PRINT REG VALUES **************************/

    for (uint8_t i = 0x2f; i < 0x38; i++) {
      read_data(i);
      while (!got_callback) {
        ;
        ;
      }
      uart_printf("data_format: %d\n", m_buffer[0]);
    }

    nrf_delay_ms(1000); // to flush log

    set_range(2);

    //*************************** CHECK **************************/

    read_data(ADXL345_DATA_FORMAT);
    uart_printf("data_format: bit0 = %d\n", getRegisterBit(ADXL345_DATA_FORMAT, 0));
    uart_printf("bit1 = %d\n", getRegisterBit(ADXL345_DATA_FORMAT, 1));
 
    setRegisterBit(ADXL345_INT_MAP, 6, 1);
    uart_printf("INT_map: bit6 = %d\n", getRegisterBit(ADXL345_INT_MAP, 6));

    setTapThreshold(50);     // 62.5 mg per increment
    setTapDuration(15);      // 625 µs per increment
    setDoubleTapLatency(80); // 1.25 ms per increment
    setDoubleTapWindow(200); // 1.25 ms per increment
    setRate(800); // rate of update of data regs in Hz
    uart_printf("Double Tap Window = %d\n", getDoubleTapWindow());
    uart_printf("TapDuration = %d\n", getTapDuration());

    setActivityXYZ(0, 0, 0);  // Set to activate movement detection in the axes "setActivityXYZ(X, Y, Z);" (1 == ON, 0 == OFF)
    setActivityThreshold(75); // 62.5mg per increment   // Set activity   // Inactivity thresholds (0-255)

    setInactivityXYZ(0, 0, 0);  // Set to detect inactivity in all the axes "setInactivityXYZ(X, Y, Z);" (1 == ON, 0 == OFF)
    setInactivityThreshold(75); // 62.5mg per increment   // Set inactivity // Inactivity thresholds (0-255)
    setTimeInactivity(10);      // How many seconds of no activity is inactive?

    uart_printf("isActivityXEnabled = %d\n", isActivityXEnabled());
    uart_printf("isActivityYEnabled = %d\n", isActivityYEnabled());

    uart_printf("isInActivityXEnabled = %d\n", isInactivityXEnabled());

    uart_printf("\r\nFATFS example.\r\n\r\n");

    fatfs_example();


//    rtc_config();

//    LEDS_ON(LED_0);
//
//    while (true) {
//      __WFI();
//    }

    static uint8_t register_address;
    register_address = ADXL345_DATAX0;
    static app_twi_transfer_t const transfers[] =
        {
            ADXL345_READ(&register_address, m_buffer, 6)

        };
    static app_twi_transaction_t const transaction =
        {
            .callback = default_cb,
            .p_user_data = NULL,
            .p_transfers = transfers,
            .number_of_transfers = sizeof(transfers) / sizeof(transfers[0])};
//    while (true) {
//    for (int i = 0; i < DATA_BUFFER_SIZE; i += 6) {
//      got_callback = false;
//      APP_ERROR_CHECK(app_twi_schedule(&m_app_twi, &transaction));
//      while (!got_callback) {;;}
//
//      for (int j = 0; j < 6; j++) {
//        data_buffer[i + j] = m_buffer[j];
//      }
//    }
//
//    for (int i = 0; i < DATA_BUFFER_SIZE; i += 6) {
//         xyz_int[0] = (((int)data_buffer[i + 1]) << 8) | data_buffer[i];
//         xyz_int[1] = (((int)data_buffer[i + 3]) << 8) | data_buffer[i + 2];
//         xyz_int[2] = (((int)data_buffer[i + 5]) << 8) | data_buffer[i + 4];
//
//        uart_printf("X: %i Y: %i Z: %i\n",
//            xyz_int[0],
//            xyz_int[1],
//            xyz_int[2]);
//    nrf_delay_ms(10);
//     }
//
//    nrf_delay_ms(2000);
//    LEDS_INVERT(BSP_LED_0_MASK);
//}
//  find number first file
    uint16_t j = 0;
    uint16_t firstFile = 0xffff;
    while ((j < NO_FILES) && (firstFile == 0xffff)) {
    uint16_t temp = j;
    for (uint8_t k = 0; k < 4; k++) {
      filename[7 - k] = temp % 10 + '0';
      temp /= 10;
    }

    ff_result = f_open(&dataFile, filename, FA_READ);
    if (ff_result == FR_NO_FILE) {
      uart_printf("First file: %i.\r\n", j);
      firstFile = j;
    } else {
      (void)f_close(&dataFile);
    }
    ++j;
      }
      if (firstFile == 0xffff)
      {
    uart_printf("All files written\r\n");
    while (true) {
    }
      }


//  start measurements
    LEDS_INVERT(BSP_LED_4_MASK);

    for (j = firstFile; j < NO_FILES; j++) {
      uint16_t temp = j;
      for (uint8_t k = 0; k < 4; k++) {
        filename[7 - k] = temp % 10 + '0';
        temp /= 10;
      }

      ff_result = f_open(&dataFile, filename, FA_READ | FA_WRITE | FA_OPEN_APPEND);
      if (ff_result != FR_OK) {
        uart_printf("Unable to create file: %i.\r\n", j);
        while (true) {
        };
      }
      uart_printf("Writing file: %i.\r\n", j);
      LEDS_INVERT(BSP_LED_0_MASK);

      //    while (count < 10000) {
      //      got_callback = false;
      //      APP_ERROR_CHECK(app_twi_schedule(&m_app_twi, &transaction));
      //      while (!got_callback) {
      //      }
      //
      //      xyz_int[0] = (((int)m_buffer[1]) << 8) | m_buffer[0];
      //      xyz_int[1] = (((int)m_buffer[3]) << 8) | m_buffer[2];
      //      xyz_int[2] = (((int)m_buffer[5]) << 8) | m_buffer[4];
      ///*
      //      uart_printf("%i,%i,%i\n",
      //          xyz_int[0],
      //          xyz_int[1],
      //          xyz_int[2]);
      //          */
      //      //    nrf_delay_ms(1);
      //
      //      sprintf(data, "%i,%i,%i\n",
      //          xyz_int[0],
      //          xyz_int[1],
      //          xyz_int[2]);
      //
      //          size_t thisBig = strlen(data);
      //
      //      ff_result = f_write(&dataFile, data, thisBig, (UINT *)&bytes_written);
      //
      //      ++count;
      //    }
    uint32_t count = 0;

      while (count < SIZE_FFT) {
        got_callback = false;
        APP_ERROR_CHECK(app_twi_schedule(&m_app_twi, &transaction));
        while (!got_callback) {
        }

        ff_result = f_write(&dataFile, m_buffer, 6, (UINT *)&bytes_written);

        ++count;
      }

      (void)f_close(&dataFile);
      LEDS_INVERT(BSP_LED_0_MASK);
      nrf_delay_ms(TIME_TO_NEXT_MEASUREMENT);
    }
    LEDS_INVERT(BSP_LED_4_MASK);
    while (true) {
    }
}
/** @} */